var square =`
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

# எழில் மொழியில் எப்படி சதுரம் உறைவது
 முன்னாடி( 90 )
 வலது( 90 )
 முன்னாடி( 90 )
 வலது( 90 )
 முன்னாடி( 90 )
 வலது( 90 )
 முன்னாடி( 90 )
 வலது( 90 )

# வேறு இடத்தில் மறுபடி ஒரு சதுரம் உறையலாம் 
 எழுதுகோல்மேலே( )
 முன்னாடி( 200 )
 வலது( 45 )
 எழுதுகோல்கிழே( )

#அனால் திரும்ப திரும்ப ஒரே கட்டளை சொல்லாமல் நீங்கள்
#இதை 'வரை' வாக்கியத்தால் செய்யலாம் 
அ = 0
@( அ < 4 ) வரை
    முன்னாடி( 90 )
    வலது( 90 )
    அ =  அ + 1
முடி

guess = சரம்_உள்ளீடு ( "உள்ளிட-விசையை >>" )
`;
var strings =`
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

   பெயர் = "உங்கள் பெயர் பெயர்"
   பதிப்பி "வணக்கம் திரு",  பெயர்
   age = log10( 10^3  ) * 3
    printf( "பெயர் %s. Age = %d",பெயர்,age)
    full = sprintf( "பெயர் %s. Age = %d, %%d   ",பெயர்,age)
    printf( full ,len( full ))
    printf( "%s %d = %s - %f", capitalize("tamil"),atoi("5"),"5.5",atof("0.5"))
    full_str = strip( full )
    printf( "full = %d, strip = %d", len(full), len( full_str ) )
    @( rfind( full, "பெயர்") >= 0 ) ஆனால்
      பதிப்பி "வாழ்த்துக்கள்! பெயர்கள் உள்ளன"
   முடி
    
`;
var tower_of_hanoi =`
# (C) 2013 Ezhil Language Project
# Author: ஸ்ரீனிவாசன் tshrinivasan@gmail.com

# Tower of Hanoi க்கு ஒரு உதாரண நிரல்.

நிரல்பாகம் ஹோனாய்(வட்டுகள், முதல்அச்சு, இறுதிஅச்சு)
    @(வட்டுகள் > 0 ) ஆனால்
        ஹோனாய்(வட்டுகள்-1, முதல்அச்சு, 6-முதல்அச்சு-இறுதிஅச்சு)
        பதிப்பி  "வட்டு " + str(வட்டுகள்) + "ஐ " + str(முதல்அச்சு) + "ஆம் அச்சில் இருந்து " +  str(இறுதிஅச்சு)+ "ஆம் அச்சிற்கு நகர்த்துக."
        ஹோனாய்(வட்டுகள்-1, 6-முதல்அச்சு-இறுதிஅச்சு, இறுதிஅச்சு)
    முடி 
முடி

ஹோனாய்(4,1,3)
`;
var reverse =`
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

assert( reverse("foo") == "oof" )
z=[1,2,3]
reverse(z)
assert( z == [3, 2, 1] )
`;
var ranges =`
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

# பைத்தான் மொழியின் உள்ள len() மற்றும் range() constructs பயன்படுத்தும் பரிசோதனை
பதிப்பி range(5,10)
பதிப்பி len(range(0,10))
பதிப்பி assert( len(range(0,10)) == 10 )
`;
var palindromes =`
## (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

சொற்கள் = பட்டியல்()

பின்இணை(சொற்கள், "ரமேஷ்")
பின்இணை(சொற்கள், "கணேஷ்")
பின்இணை(சொற்கள், "மகேஷ்")

பின்இணை(சொற்கள், "காமாட்சி")
பின்இணை(சொற்கள், "மீனாட்சி")
பின்இணை(சொற்கள், "விசாலாட்சி")

பின்இணை(சொற்கள், "மேளதாளமே")
பின்இணை(சொற்கள், "தேயுதே")
பின்இணை(சொற்கள், "மாறுமா")
பின்இணை(சொற்கள், "வினவி")
பின்இணை(சொற்கள், "விகடகவி")


பின்இணை(சொற்கள்,"2002")
பின்இணை(சொற்கள், "1991")
பின்இணை(சொற்கள், "2992")
பின்இணை(சொற்கள், "1729")

idx = 0

@(idx < len(சொற்கள்) )  வரை
   @(  தலைகீழ்( எடு(சொற்கள், idx ) ) ==  எடு(சொற்கள் ,idx) )  ஆனால்
      பதிப்பி "palindrome  == " , எடு(சொற்கள், idx )
   இல்லை
      பதிப்பி "not a plaindrome ==  ",எடு(சொற்கள், idx )
   முடி
   idx = idx + 1
முடி
`;
var bubblesort =`
# (C) முத்தையா அண்ணாமலை 2013
# (A) என். சொக்கன்
# எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

## Bubble Sort Example
## எண்களை Bubble Sort முறைப்படி அடுக்கும் உதாரணம்

## இது நிரல் ஒரு பட்டியலில் உள்ள எண்களை Bubble Sort என்ற முறைப்படி ஏறுவரிசையிலும் பின்னர் அதையே இறங்குவரிசையிலும் அடுக்கித் தரும்

நிரல்பாகம் மாற்றிப்போடு(ஒருபட்டியல், நிலை1, நிலை2)

  ## இது நிரல்பாகம் தரப்பட்ட பட்டியலில் உள்ள இரு நிலைகளை மாற்றி(swap)த்தரும். உதாரணமாக, 8, 9 என்ற எண்கள் தரப்பட்டால், 8ம் இடத்தில் உள்ள எண் 9ம் இடத்துக்கும், 9ம் இடத்தில் உள்ள எண் 10ம் இடத்துக்கும் மாறும்

  எண்1 = எடு(ஒருபட்டியல், நிலை1)
  எண்2 = எடு(ஒருபட்டியல், நிலை2)

        வெளியேஎடு(ஒருபட்டியல், நிலை1)
        நுழைக்க(ஒருபட்டியல், நிலை1, எண்2)
        வெளியேஎடு(ஒருபட்டியல், நிலை2)
        நுழைக்க(ஒருபட்டியல், நிலை2, எண்1)
  
  பின்கொடு ஒருபட்டியல்

முடி

நிரல்பாகம் வரிசை(ஒருபட்டியல், வரிசை)

  ## வரிசை = 1 என்றால் ஏறுவரிசை, வரிசை = 2 என்றால் இறங்குவரிசை

  நீளம் = len(ஒருபட்டியல்)
  குறைநீளம் = நீளம் - 1

  @(குறைநீளம் != -1) வரை
    மாற்றம் = -1
    @(எண் = 0, எண் < குறைநீளம், எண் = எண் + 1) ஆக
      முதலெண் = எடு(ஒருபட்டியல், எண்)
      இரண்டாமெண் = எடு(ஒருபட்டியல், எண் + 1)
      @(வரிசை == 1) ஆனால்
        @(முதலெண் > இரண்டாமெண்) ஆனால்

          ## சிறிய எண்ணை முன்னுக்குத் தள்ளவேண்டும்

          மாற்றிப்போடு(ஒருபட்டியல், எண், எண் + 1)
          மாற்றம் = எண்
        முடி
      முடி
      @(வரிசை == 2) ஆனால்
        @(இரண்டாமெண் > முதலெண்) ஆனால்

          ## பெரிய எண்ணை முன்னுக்குத் தள்ளவேண்டும்

          மாற்றிப்போடு(ஒருபட்டியல், எண், எண் + 1)
          மாற்றம் = எண்
        முடி
      முடி
    முடி
    குறைநீளம் = மாற்றம்
  முடி
  பின்கொடு ஒருபட்டியல்
முடி

## மாதிரிக்கு நாம் ஏழு எண்களை எடுத்துக்கொள்வோம்

எண்கள் = [5, 1, 10, 8, 1, 21, 4, 2]
எண்கள்பிரதி = எண்கள்

பதிப்பி "ஆரம்பப் பட்டியல்:"
பதிப்பி எண்கள்

ஏறும்பட்டியல் = வரிசை(எண்கள், 1)

பதிப்பி "ஏறு வரிசையில் அமைக்கப்பட்ட பட்டியல்:"
பதிப்பி ஏறும்பட்டியல்

இறங்கும்பட்டியல் = வரிசை(எண்கள், 2)

பதிப்பி "இறங்கு வரிசையில் அமைக்கப்பட்ட பட்டியல்:"
பதிப்பி இறங்கும்பட்டியல்
`;
var select_case =`
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

# select-case statement | grammar keeping with SOVA

ஊர் = உள்ளீடு ("உங்கள் ஊர் என்ன? ")

@(ஊர்) தேர்ந்தெடு
@("சென்னை") தேர்வு 
	பதிப்பி "சென்னையில் உள்ள மெரீனா கடற்கரை அழகானது!"	
@("கோவை") தேர்வு 
	பதிப்பி "கோவையின் தமிழ் மிக இனிமையானது!"	
@("மதுரை") தேர்வு 
	பதிப்பி "சிறந்த கோயில்கள் நிறைந்தது மதுரை!"	
ஏதேனில்
	பதிப்பி "உங்கள் ஊர்பற்றி அறிந்ததில் மகிழ்ச்சி! Good to know!"	
முடி
`;
var speedoflight =`
# Ezhil Programming Language example
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

C = 3e8 # Speed of light in m/s
C = C/1e3 # move to km/s
roundtrip_around_equator = 249901.47 #in mi
roundtrip_around_equator = roundtrip_around_equator*16e-1 #in km

time_for_light_to_travel = roundtrip_around_equator/C

பதிப்பி "circumference of earth is",roundtrip_around_equator
பதிப்பி "time for light to travel around earth =", time_for_light_to_travel, "seconds\n"

roundtrip_around_equator = 249901.47*16e-1 #in km
time_for_light_to_travel = roundtrip_around_equator/C

பதிப்பி "In 60 seconds light to travels around earth ", 600e-2/time_for_light_to_travel, "times"

#alternative answer
dia_at_equator = 40000 #in km
t_rt = dia_at_equator/C
பதிப்பி "time for 1 roundtrip = ",t_rt," seconds\n"
பதிப்பி "roundtrips per second = ",1/t_rt," times"


`;
var factorial =`
# (C) முத்தையா அண்ணாமலை 2015
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

நிரல்பாகம்  fact ( n )
  @( n == 0 ) ஆனால்
            பின்கொடு  1.0
     இல்லை
            பின்கொடு    n*fact( n - 1.0 )
    முடி
முடி

printf("%g",fact(5.0))
`;
var beer_bottles_song =`
# (C) முத்தையா அண்ணாமலை 2015
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

# Ref: http://www.99-bottles-of-beer.net/lyrics.html
# Ref: submitted to http://www.99-bottles-of-beer.net/abc.html

அ = 100
@( range(அ,-1,-1) இல் இ ) ஒவ்வொன்றாக
  @( இ == 1 ) ஆனால்
    பதிப்பி "1 bottle of beer on the wall, 1 bottle of beer."
    பதிப்பி "Take one down and pass it around, no more bottles of beer on the wall."
  @( இ == 2 )    இல்லைஆனால்
    பதிப்பி இ," bottles of beer on the wall",இ,"bottles of beer."
    பதிப்பி "Take one down and pass it around",இ-1,"bottle of beer on the wall."
  @( இ == 0 )    இல்லைஆனால்
    பதிப்பி "No more bottles of beer on the wall, no more bottles of beer."
    பதிப்பி "Go to the store and buy some more, 99 bottles of beer on the wall."
  இல்லை
     #இ > 2
    பதிப்பி இ," bottles of beer on the wall",இ,"bottles of beer."
    பதிப்பி "Take one down and pass it around",இ-1,"bottles of beer on the wall."
  முடி
  பதிப்பி ""
முடி
`;
var array_nd = `
# (C) முத்தையா அண்ணாமலை 2013
# இது ஒரு எழில் தமிழ் நிரலாக்க மொழி உதாரணம்

z = [ 1 , 2 , 4, 5, 10 ]
x = [ 5-6, 8-10, 8*4 - 4*9, -5, 9 -11 - 8 ]

i = 0
@( i < len(x) )  வரை
பதிப்பி    z[i] +  x[i]
assert( ( z[i] +  x[i] ) == 0 )
i = i + 1
முடி

பதிப்பி "வணக்கம்! learn about multi-dimensional jagged arrays"

x=[1,2,[3,4]]
பதிப்பி x[0]
பதிப்பி x[1]
பதிப்பி x[2]
பதிப்பி x[2,0]
பதிப்பி x[2,1]
`;
examples = {'palindromes.n': palindromes, 'ranges.n': ranges, 'beer_bottles_song.n': beer_bottles_song, 'square.n': square, 'strings.n': strings, 'bubblesort.n': bubblesort, 'factorial.n': factorial, 'speedoflight.n': speedoflight, 'tower_of_hanoi.n': tower_of_hanoi, 'select_case.n': select_case, 'reverse.n': reverse, 'array_nd.n': array_nd};
